trade_exp/src/Documents/БлокировкаДвиженияТоваров/БлокировкаДвиженияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ec36221d-37a4-4c12-9c34-7cb1eceaead1">
  <name>БлокировкаДвиженияТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РаспределениеЗапасовДвижения</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes extendedConfigurationObject="bcd3b202-1b4b-4cb7-9c80-2a93e9f648db">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8173986d-73df-48fa-9cc8-38cfe45d8748">
    <name>БлокировкаОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f9d0fad-e42e-4731-8107-06e3f90b212d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="441ea6d9-ec19-4570-b97b-f8e66ebbde99">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8671922f-e1fb-486a-bbb5-fd960e199e94">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="250a0493-3164-44eb-9b46-4baeac4f1c2c">
    <name>ПричинаБлокировки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c23c42b8-9959-4ace-91a6-5a7cbc2fbb63">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="a9f05fa3-fa19-43ed-95dd-01e6677ecdf1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d8f9f1e5-d2cd-4da7-ad72-aefa73478085">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89a7e0a8-ebb3-4118-ac5f-b614e1a2fac3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42ebd587-1a10-4279-b4c1-ce101094cfa4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a7742230-e6be-4988-9a70-2b9318d2e6e8">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c9e23b65-d2dd-4d5e-91a1-60a62757322c">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4979558b-bd14-48f3-a52d-805e31ec5e65">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8187f1a4-6517-4240-ace4-08511908ce30">
    <name>ВходящийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4058b5f7-fa3b-4b4e-abe9-cf3afe19677f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f4ff2bf1-a8d5-487c-98fc-c15da9a88779">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/БлокировкаДвиженияТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда	
	
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ЭтоНовыйДокумент = ЭтоНовый();
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовыйДокумент);
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	Если ЭтоНовыйДокумент И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	Если ПометкаУдаления ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЗапретРаспроведенияЗаблокированных(Отказ);		
	КонецЕсли;
	
	Если Не Отказ И ПометкаУдаления И Не Проведен Тогда
		БлокировкаОснование = Документы.БлокировкаДвиженияТоваров.ПустаяСсылка();		
	КонецЕсли;
	
КонецПроцедуры 

&Вместо("ПриЗаписи")
Процедура Док_ПриЗаписи(Отказ)	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);   	
КонецПроцедуры

&Вместо("ПередУдалением")
Процедура ПередУдалением(Отказ)
	ЗапретРаспроведенияЗаблокированных(Отказ);
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		БылПроведен = Ложь;
	Иначе
		БылПроведен = Документы.БлокировкаДвиженияТоваров.ВыполнитьКонтрольБлокировкиПослеПроведения(Ссылка, Отказ);
	КонецЕсли;	
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	Результат = Документы.БлокировкаДвиженияТоваров.ВыполнитьКонтрольБлокировкиПослеПроведения(Ссылка, Отказ);
	
	ПроводитьОрдера = Истина;    
	
	Если ДополнительныеСвойства.Свойство("ПроведениеИзПриходногоОрдера") Тогда 
		ПроводитьОрдера = Не ДополнительныеСвойства.ПроведениеИзПриходногоОрдера;
	КонецЕсли;
	
	Если ПроводитьОрдера Тогда
		Документы.БлокировкаДвиженияТоваров.ПерепровестиПриходныеОрдера(Ссылка,Отказ);
	КонецЕсли;
	
	Если ЭтотОбъект.Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано И НЕ БылПроведен
		 И Результат Тогда
	ПричиныБлокировки = Новый Массив;
	ПричиныБлокировки.Добавить("Брак");
	ПричиныБлокировки.Добавить("Брак на складе");
	ПричиныБлокировки.Добавить("Брак от покупателей");
	ПричиныБлокировки.Добавить("Возврат поставщику");
	ПричиныБлокировки.Добавить("Для благотворительности");
	ПричиныБлокировки.Добавить("Сроки годности");
		Если ПричиныБлокировки.Найти(ЭтотОбъект.ПричинаБлокировки.Наименование) <> Неопределено Тогда
			
			ПараметрыСообщения = Новый Структура;
			Если ЭтотОбъект.БлокировкаОснование <> Документы.БлокировкаДвиженияТоваров.ПустаяСсылка() Тогда
				ПараметрыСообщения.Вставить("НомерБлокировки", ЭтотОбъект.БлокировкаОснование.Номер);
			КонецЕсли;
			ПараметрыСообщения.Вставить("АвторРазблокировки", ЭтотОбъект.Ответственный);
			параметрыСообщения.Вставить("Склад", ЭтотОбъект.Склад);
			ПараметрыСообщения.Вставить("РуководительСекции");
			ПараметрыСообщения.Вставить("СписокТоваров");
			     
			Если ЭтотОбъект.БлокировкаОснование <> Документы.БлокировкаДвиженияТоваров.ПустаяСсылка() И ЗначениеЗаполнено(ЭтотОбъект.БлокировкаОснование.Комментарий) Тогда
				ПараметрыСообщения.Вставить("Комментарий", ЭтотОбъект.БлокировкаОснование.Комментарий);
			ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Комментарий) Тогда
				ПараметрыСообщения.Вставить("Комментарий", ЭтотОбъект.Комментарий); 
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
							| 	ТЧДок.Номенклатура КАК Номенклатура,
							| 	ТЧДок.КоличествоУпаковок КАК Количество,
							| 	Секции.Руководитель КАК РуководительСекции
							| ИЗ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
							| 	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеУчастки КАК Секции
							| 		ПО Секции.Ссылка = Ячейки.Ячейка.РабочийУчасток
							| 	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БлокировкаДвиженияТоваров.Товары КАК ТЧДок
							| 		ПО ТЧДок.Номенклатура = Ячейки.Номенклатура
							| 		И ТЧДок.Ссылка.Склад = Ячейки.Склад
							| 		И ТЧДок.Ссылка = &Ссылка
							| СГРУППИРОВАТЬ ПО
							| 	ТЧДок.Номенклатура,
							| 	ТЧДок.КоличествоУпаковок,
							| 	Секции.Руководитель
							| ИТОГИ ПО
							| 	Секции.Руководитель";
			
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗапроса.Следующий() Цикл
				ВыборкаПоСекции = ВыборкаЗапроса.Выбрать();
				СписокТоваров = "";
				Пока ВыборкаПоСекции.Следующий() Цикл
					СписокТоваров = СписокТоваров + Символы.ПС + ВыборкаПоСекции.Номенклатура + Символы.Таб + " Кол-во " + ВыборкаПоСекции.Количество;
					РуководительСекции = ВыборкаПоСекции.РуководительСекции;
				КонецЦикла;
				ПараметрыСообщения.СписокТоваров = СписокТоваров;
				ПараметрыСообщения.РуководительСекции = РуководительСекции;
				ДопМодуль.ОтправитьСообщениеОРазблокировкеВБитрикс24(ПараметрыСообщения);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если Не рольДоступна("ПолныеПрава") И Не ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтключитьКонтроль") И 
		 Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано И	
		(ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ 
		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ
		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров")) Тогда
		ПриходныеОрдера = Документы.БлокировкаДвиженияТоваров.ПолучитьПриходныеОрдераПоДокументуОснованию(ДокументОснование);
		Если ПриходныеОрдера.Количество()>0 Тогда
			Отказ = Истина;
			АльтерраОбщегоНазначения.СообщитьПользователю(,"По документу основанию созданы приходные ордера!",)
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ И ПометкаУдаления И Проведен Тогда
		БлокировкаОснование = Документы.БлокировкаДвиженияТоваров.ПустаяСсылка();		
	КонецЕсли; 
	
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда 
		ЗаполнитьПоПриходномуОрдеру(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда	
		ЗаполнитьПоПеремещению(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда	
		ЗаполнитьПоКорректировкеРеализации(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда	
		ЗаполнитьПоВозвратуТоваров(ДанныеЗаполнения);	
	КонецЕсли;
	ИнициализироватьДокумент(ДанныеЗаполнения);  
	
КонецПроцедуры
	
Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Если Не ЗначениеЗаполнено(Статус) тогда
		статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	КонецЕсли;
		
КонецПроцедуры
	
Процедура ЗаполнитьПоПриходномуОрдеру(ДанныеЗаполнения)
		
	Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	Склад = ДанныеЗаполнения.Склад;
	ДокументОснование = ДанныеЗаполнения;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|	ПриходныйОрдерНаТоварыТовары.Характеристика КАК Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.КоличествоУпаковок КАК Количество
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Товары.Загрузить(РезультатЗапроса.Выгрузить());
			
КонецПроцедуры
	
Процедура ЗаполнитьПоПеремещению(ДанныеЗаполнения)
		
	Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	Склад = ДанныеЗаполнения.СкладПолучатель;
	ДокументОснование = ДанныеЗаполнения;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Товары.Загрузить(РезультатЗапроса.Выгрузить());	
		
КонецПроцедуры

Процедура ЗаполнитьПоКорректировкеРеализации(ДанныеЗаполнения)
		
	Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоКоду("000000007");
	Склад = ДанныеЗаполнения.Склад;
	ДокументОснование = ДанныеЗаполнения;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализацииРасхождения.Номенклатура КАК Номенклатура,
	|	КорректировкаРеализацииРасхождения.Характеристика КАК Характеристика,
	|	-1 * КорректировкаРеализацииРасхождения.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииРасхождения
	|ГДЕ
	|	КорректировкаРеализацииРасхождения.Ссылка = &Ссылка
	|	И КорректировкаРеализацииРасхождения.КоличествоУпаковок < 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Товары.Загрузить(РезультатЗапроса.Выгрузить());	
		
КонецПроцедуры
	
Процедура ЗаполнитьПоВозвратуТоваров(ДанныеЗаполнения)
		
	Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано;
	ПричинаБлокировки = Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоКоду("000000011");
	Склад = ДанныеЗаполнения.Склад;
	ДокументОснование = ДанныеЗаполнения;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ВозвратТоваровОтКлиентаТовары.Характеристика КАК Характеристика,
	|	ВозвратТоваровОтКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
	|ГДЕ
	|	ВозвратТоваровОтКлиентаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Товары.Загрузить(РезультатЗапроса.Выгрузить());
		
КонецПроцедуры

Процедура ЗапретРаспроведенияЗаблокированных(Отказ)      	
	
	Если Не Отказ И Статус = Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(БлокировкаДвиженияТоваров.Ссылка) КАК Ссылка
			|ИЗ
			|	Документ.БлокировкаДвиженияТоваров КАК БлокировкаДвиженияТоваров
			|ГДЕ
			|	БлокировкаДвиженияТоваров.БлокировкаОснование = &БлокировкаОснование";
		
		Запрос.УстановитьПараметр("БлокировкаОснование", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ТекстОшибки = "Отмена проведения запрещена! Существуют созданные на этом основании документы:" + Символы.ПС + Символы.ПС;
			РезультатЗапроса = РезультатЗапроса.Выбрать();
			
			Пока РезультатЗапроса.Следующий() Цикл
				ТекстОшибки = ТекстОшибки + РезультатЗапроса.Ссылка + Символы.ПС;
			КонецЦикла;
			
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;  
	
КонецПроцедуры

Функция ПолучитьКоличествоДляРазблокировки(Ссылка) Экспорт 

	Запрос = Новый Запрос();
	Запрос.Текст = "
      	|ВЫБРАТЬ 
      	|	БлокировкаДвиженияТовары.Номенклатура, 
      	|	БлокировкаДвиженияТовары.Ссылка.Склад, 
      	|	БлокировкаДвиженияТовары.Характеристика, 
      	|	БлокировкаДвиженияТовары.Упаковка, 
      	|	Сумма(БлокировкаДвиженияТовары.КоличествоУпаковок) КАК Количество      	
      	|ПОМЕСТИТЬ 
      	|	ТоварыЗаблокировано
      	|ИЗ
      	|	Документ.БлокировкаДвиженияТоваров.Товары  КАК БлокировкаДвиженияТовары
      	|	
      	|ГДЕ 
      	|	БлокировкаДвиженияТовары.Ссылка = &Ссылка
      	|	И БлокировкаДвиженияТовары.Ссылка.Статус = Значение(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано)
      	|	И БлокировкаДвиженияТовары.Ссылка.Проведен
      	|СГРУППИРОВАТЬ ПО 
      	|	БлокировкаДвиженияТовары.Номенклатура, 
      	|	БлокировкаДвиженияТовары.Ссылка.Склад,	
      	|	БлокировкаДвиженияТовары.Характеристика,
      	|	БлокировкаДвиженияТовары.Упаковка 
      	|;
	  	|ВЫБРАТЬ 
      	|	БлокировкаДвиженияТовары.Номенклатура, 
		|	БлокировкаДвиженияТовары.Ссылка.Склад,       		
      	|	БлокировкаДвиженияТовары.Характеристика, 
      	|	БлокировкаДвиженияТовары.Упаковка,
      	|	Сумма(БлокировкаДвиженияТовары.КоличествоУпаковок) КАК Количество
      	|ПОМЕСТИТЬ 
      	|	ТоварыРазблокировано
      	|ИЗ
      	|	Документ.БлокировкаДвиженияТоваров.Товары  КАК БлокировкаДвиженияТовары
      	|	
      	|ГДЕ 
      	|	БлокировкаДвиженияТовары.Ссылка.БлокировкаОснование = &Ссылка
      	|	И БлокировкаДвиженияТовары.Ссылка.Статус = Значение(Перечисление.СтатусыБлокировкиДвиженияНоменклатуры.Разблокировано)
      	|	И БлокировкаДвиженияТовары.Ссылка.Проведен
      	|СГРУППИРОВАТЬ ПО 
      	|	БлокировкаДвиженияТовары.Номенклатура, 
      	|	БлокировкаДвиженияТовары.Ссылка.Склад,
      	|	БлокировкаДвиженияТовары.Характеристика, 
      	|	БлокировкаДвиженияТовары.Упаковка
      	|;
      	|ВЫБРАТЬ 
      	|	ТоварыЗаблокировано.Номенклатура,
      	|	ТоварыЗаблокировано.Склад,
      	|	ТоварыЗаблокировано.Характеристика,
      	|	ТоварыЗаблокировано.Упаковка,
      	|	ЕСТЬNULL(ТоварыЗаблокировано.Количество, 0) КАК ЗаблокированоКоличество,
      	|	ЕСТЬNULL(ТоварыРазблокировано.Количество, 0) КАК РазблокированоКоличество,
      	|	ЕСТЬNULL(ТоварыЗаблокировано.Количество, 0) - ЕСТЬNULL(ТоварыРазблокировано.Количество, 0) КАК ИтогоКоличество
      	|ИЗ 
      	|	ТоварыЗаблокировано 
      	|	ЛЕВОЕ СОЕДИНЕНИЕ 
      	|		ТоварыРазблокировано 
      	|	ПО
      	|		ТоварыЗаблокировано.Номенклатура = ТоварыРазблокировано.Номенклатура
      	|		И ТоварыЗаблокировано.Характеристика = ТоварыРазблокировано.Характеристика
      	|		И ТоварыЗаблокировано.Склад = ТоварыРазблокировано.Склад
		|ГДЕ ЕСТЬNULL(ТоварыЗаблокировано.Количество, 0) - ЕСТЬNULL(ТоварыРазблокировано.Количество, 0) > 0		
		|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос;
	
КонецФункции

#КонецЕсли
